from gtts import gTTS
import os

text = "ہ دنیا ایک خوبصورت مگر پیچیدہ جگہ ہے جہاں ہر انسان اپنی منزل کی تلاش میں مصروف ہے۔ کچھ لوگ دولت کے پیچھے بھاگتے ہیں، کچھ علم کے، اور کچھ صرف سکون کے متلاشی ہوتے ہیں۔ کامیابی صرف ان لوگوں کو ملتی ہے جو محنت اور صبر کا دامن نہیں چھوڑتے۔ زندگی میں ناکامی آنا کوئی بری بات نہیں، بلکہ یہ ہمیں سکھاتی ہے کہ کہاں غلطی ہوئی اور اگلی بار کیسے بہتر بننا ہے۔ اصل کامیابی یہی ہے کہ انسان کبھی ہار نہ مانے اور ہر مشکل کے بعد ایک نئی اُمید کے ساتھ اُٹھے"
tts = gTTS(text=text, lang="ur", slow=False)
tts.save("free_tts.mp3")

print("✅ Saved as free_tts.mp3")
os.system("start free_tts.mp3")  # Auto play on Windows
